/*************************************************************************
	> File Name: 125.c
	> Author: 
	> Mail: 
	> Created Time: 2020年01月10日 星期五 18时44分23秒
 ************************************************************************/

#include <stdio.h>
int main() { 
    int h, m, s, t;
    scanf("%d %d %d %d", &h, &m, &s, &t);
    s += t;
    m += s / 60;
    s %= 60;
    h += m / 60;
    m %= 60;
    h %= 24;
    if(h >= 12 ) {
        h != 12 && (h %= 12);
        printf("%d:%d:%dpm\n", h, m, s);
    }
    else{
        !h && (h += 12);
        printf("%d:%d:%dam\n", h, m, s);
    } 
    printf("%.2f%c", t * 1.0 / 864, '%');
    return 0;
}
